EmbeddedMan/history/hcs12/mc9s12dt256.h
/* Based on CPU DB MC9S12DT256_112, version 2.87.373 (RegistersPrg V2.23) */
/*
** ###################################################################
**     Filename  : mc9s12dt256.h
**     Processor : MC9S12DT256CPV
**     FileFormat: V2.23
**     DataSheet : 9S12DP256BDGV3/D V03.07
**     Compiler  : CodeWarrior compiler
**     Date/Time : 19.03.2008, 14:53
**     Abstract  :
**         This header implements the mapping of I/O devices.
**
**     (c) Copyright UNIS, spol. s r.o. 1997-2008
**     UNIS, spol. s r.o.
**     Jundrovska 33
**     624 00 Brno
**     Czech Republic
**     http      : www.processorexpert.com
**     mail      : info@processorexpert.com
**
**     CPU Registers Revisions:
**               - none
**
**     File-Format-Revisions:
**               - none
**
**     Not all general-purpose I/O pins are available on all packages or on all mask sets of a specific
**     derivative device. To avoid extra current drain from floating input pins, the user’s reset
**     initialization routine in the application program must either enable on-chip pull-up devices
**     or change the direction of unconnected pins to outputs so the pins do not float.
** ###################################################################
*/

#ifndef _MC9S12DT256_H
#define _MC9S12DT256_H

/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */
#pragma OPTION ADD V30toV31Compatible "-BfaGapLimitBits4294967295" /*this guarantee correct bitfield positions*/

/**************** interrupt vector numbers ****************/
#define VectorNumber_VReserved63        63
#define VectorNumber_VReserved62        62
#define VectorNumber_VReserved61        61
#define VectorNumber_VReserved60        60
#define VectorNumber_VReserved59        59
#define VectorNumber_VReserved58        58
#define VectorNumber_Vpwmesdn           57
#define VectorNumber_Vportp             56
#define VectorNumber_Vcan4tx            55
#define VectorNumber_Vcan4rx            54
#define VectorNumber_Vcan4err           53
#define VectorNumber_Vcan4wkup          52
#define VectorNumber_VReserved51        51
#define VectorNumber_VReserved50        50
#define VectorNumber_VReserved49        49
#define VectorNumber_VReserved48        48
#define VectorNumber_VReserved47        47
#define VectorNumber_VReserved46        46
#define VectorNumber_VReserved45        45
#define VectorNumber_VReserved44        44
#define VectorNumber_Vcan1tx            43
#define VectorNumber_Vcan1rx            42
#define VectorNumber_Vcan1err           41
#define VectorNumber_Vcan1wkup          40
#define VectorNumber_Vcan0tx            39
#define VectorNumber_Vcan0rx            38
#define VectorNumber_Vcan0err           37
#define VectorNumber_Vcan0wkup          36
#define VectorNumber_Vflash             35
#define VectorNumber_Veeprom            34
#define VectorNumber_Vspi2              33
#define VectorNumber_Vspi1              32
#define VectorNumber_Viic               31
#define VectorNumber_VReserved30        30
#define VectorNumber_Vcrgscm            29
#define VectorNumber_Vcrgplllck         28
#define VectorNumber_Vtimpabovf         27
#define VectorNumber_Vtimmdcu           26
#define VectorNumber_Vporth             25
#define VectorNumber_Vportj             24
#define VectorNumber_Vatd1              23
#define VectorNumber_Vatd0              22
#define VectorNumber_Vsci1              21
#define VectorNumber_Vsci0              20
#define VectorNumber_Vspi0              19
#define VectorNumber_Vtimpaie           18
#define VectorNumber_Vtimpaaovf         17
#define VectorNumber_Vtimovf            16
#define VectorNumber_Vtimch7            15
#define VectorNumber_Vtimch6            14
#define VectorNumber_Vtimch5            13
#define VectorNumber_Vtimch4            12
#define VectorNumber_Vtimch3            11
#define VectorNumber_Vtimch2            10
#define VectorNumber_Vtimch1            9
#define VectorNumber_Vtimch0            8
#define VectorNumber_Vrti               7
#define VectorNumber_Virq               6
#define VectorNumber_Vxirq              5
#define VectorNumber_Vswi               4
#define VectorNumber_Vtrap              3
#define VectorNumber_Vcop               2
#define VectorNumber_Vclkmon            1
#define VectorNumber_Vreset             0

/**************** interrupt vector table ****************/
#define VReserved63                     0x0000FF80
#define VReserved62                     0x0000FF82
#define VReserved61                     0x0000FF84
#define VReserved60                     0x0000FF86
#define VReserved59                     0x0000FF88
#define VReserved58                     0x0000FF8A
#define Vpwmesdn                        0x0000FF8C
#define Vportp                          0x0000FF8E
#define Vcan4tx                         0x0000FF90
#define Vcan4rx                         0x0000FF92
#define Vcan4err                        0x0000FF94
#define Vcan4wkup                       0x0000FF96
#define VReserved51                     0x0000FF98
#define VReserved50                     0x0000FF9A
#define VReserved49                     0x0000FF9C
#define VReserved48                     0x0000FF9E
#define VReserved47                     0x0000FFA0
#define VReserved46                     0x0000FFA2
#define VReserved45                     0x0000FFA4
#define VReserved44                     0x0000FFA6
#define Vcan1tx                         0x0000FFA8
#define Vcan1rx                         0x0000FFAA
#define Vcan1err                        0x0000FFAC
#define Vcan1wkup                       0x0000FFAE
#define Vcan0tx                         0x0000FFB0
#define Vcan0rx                         0x0000FFB2
#define Vcan0err                        0x0000FFB4
#define Vcan0wkup                       0x0000FFB6
#define Vflash                          0x0000FFB8
#define Veeprom                         0x0000FFBA
#define Vspi2                           0x0000FFBC
#define Vspi1                           0x0000FFBE
#define Viic                            0x0000FFC0
#define VReserved30                     0x0000FFC2
#define Vcrgscm                         0x0000FFC4
#define Vcrgplllck                      0x0000FFC6
#define Vtimpabovf                      0x0000FFC8
#define Vtimmdcu                        0x0000FFCA
#define Vporth                          0x0000FFCC
#define Vportj                          0x0000FFCE
#define Vatd1                           0x0000FFD0
#define Vatd0                           0x0000FFD2
#define Vsci1                           0x0000FFD4
#define Vsci0                           0x0000FFD6
#define Vspi0                           0x0000FFD8
#define Vtimpaie                        0x0000FFDA
#define Vtimpaaovf                      0x0000FFDC
#define Vtimovf                         0x0000FFDE
#define Vtimch7                         0x0000FFE0
#define Vtimch6                         0x0000FFE2
#define Vtimch5                         0x0000FFE4
#define Vtimch4                         0x0000FFE6
#define Vtimch3                         0x0000FFE8
#define Vtimch2                         0x0000FFEA
#define Vtimch1                         0x0000FFEC
#define Vtimch0                         0x0000FFEE
#define Vrti                            0x0000FFF0
#define Virq                            0x0000FFF2
#define Vxirq                           0x0000FFF4
#define Vswi                            0x0000FFF6
#define Vtrap                           0x0000FFF8
#define Vcop                            0x0000FFFA
#define Vclkmon                         0x0000FFFC
#define Vreset                          0x0000FFFE

/**************** registers I/O map ****************/

/*** PORTAB - Port AB Register; 0x00000000 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PORTA - Port A Register; 0x00000000 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Port A Bit 0 */
        byte BIT1        :1;                                       /* Port A Bit 1 */
        byte BIT2        :1;                                       /* Port A Bit 2 */
        byte BIT3        :1;                                       /* Port A Bit 3 */
        byte BIT4        :1;                                       /* Port A Bit 4 */
        byte BIT5        :1;                                       /* Port A Bit 5 */
        byte BIT6        :1;                                       /* Port A Bit 6 */
        byte BIT7        :1;                                       /* Port A Bit 7 */
      } Bits;
    } PORTASTR;
    #define PORTA                       _PORTAB.Overlap_STR.PORTASTR.Byte
    #define PORTA_BIT0                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT0
    #define PORTA_BIT1                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT1
    #define PORTA_BIT2                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT2
    #define PORTA_BIT3                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT3
    #define PORTA_BIT4                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT4
    #define PORTA_BIT5                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT5
    #define PORTA_BIT6                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT6
    #define PORTA_BIT7                  _PORTAB.Overlap_STR.PORTASTR.Bits.BIT7
    
    #define PORTA_BIT0_MASK             1
    #define PORTA_BIT1_MASK             2
    #define PORTA_BIT2_MASK             4
    #define PORTA_BIT3_MASK             8
    #define PORTA_BIT4_MASK             16
    #define PORTA_BIT5_MASK             32
    #define PORTA_BIT6_MASK             64
    #define PORTA_BIT7_MASK             128
    

    /*** PORTB - Port B Register; 0x00000001 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Port B Bit 0 */
        byte BIT1        :1;                                       /* Port B Bit 1 */
        byte BIT2        :1;                                       /* Port B Bit 2 */
        byte BIT3        :1;                                       /* Port B Bit 3 */
        byte BIT4        :1;                                       /* Port B Bit 4 */
        byte BIT5        :1;                                       /* Port B Bit 5 */
        byte BIT6        :1;                                       /* Port B Bit 6 */
        byte BIT7        :1;                                       /* Port B Bit 7 */
      } Bits;
    } PORTBSTR;
    #define PORTB                       _PORTAB.Overlap_STR.PORTBSTR.Byte
    #define PORTB_BIT0                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT0
    #define PORTB_BIT1                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT1
    #define PORTB_BIT2                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT2
    #define PORTB_BIT3                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT3
    #define PORTB_BIT4                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT4
    #define PORTB_BIT5                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT5
    #define PORTB_BIT6                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT6
    #define PORTB_BIT7                  _PORTAB.Overlap_STR.PORTBSTR.Bits.BIT7
    
