EmbeddedMan/history/hcs12/mc9s12dt256.h
#define FPROT_FPLS0_MASK                1
#define FPROT_FPLS1_MASK                2
#define FPROT_FPLDIS_MASK               4
#define FPROT_FPHS0_MASK                8
#define FPROT_FPHS1_MASK                16
#define FPROT_FPHDIS_MASK               32
#define FPROT_NV6_MASK                  64
#define FPROT_FPOPEN_MASK               128
#define FPROT_FPLS_MASK                 3
#define FPROT_FPLS_BITNUM               0
#define FPROT_FPHS_MASK                 24
#define FPROT_FPHS_BITNUM               3


/*** FSTAT - Flash Status Register; 0x00000105 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte BLANK       :1;                                       /* Blank Verify Flag */
    byte             :1; 
    byte ACCERR      :1;                                       /* Access error */
    byte PVIOL       :1;                                       /* Protection violation */
    byte CCIF        :1;                                       /* Command Complete Interrupt Flag */
    byte CBEIF       :1;                                       /* Command Buffers Empty Interrupt Flag */
  } Bits;
} FSTATSTR;
extern volatile FSTATSTR _FSTAT @(REG_BASE + 0x00000105);
#define FSTAT                           _FSTAT.Byte
#define FSTAT_BLANK                     _FSTAT.Bits.BLANK
#define FSTAT_ACCERR                    _FSTAT.Bits.ACCERR
#define FSTAT_PVIOL                     _FSTAT.Bits.PVIOL
#define FSTAT_CCIF                      _FSTAT.Bits.CCIF
#define FSTAT_CBEIF                     _FSTAT.Bits.CBEIF

#define FSTAT_BLANK_MASK                4
#define FSTAT_ACCERR_MASK               16
#define FSTAT_PVIOL_MASK                32
#define FSTAT_CCIF_MASK                 64
#define FSTAT_CBEIF_MASK                128


/*** FCMD - Flash Command Buffer and Register; 0x00000106 ***/
typedef union {
  byte Byte;
  struct {
    byte CMDB0       :1;                                       /* NVM User Mode Command Bit 0 */
    byte             :1; 
    byte CMDB2       :1;                                       /* NVM User Mode Command Bit 2 */
    byte             :1; 
    byte             :1; 
    byte CMDB5       :1;                                       /* NVM User Mode Command Bit 5 */
    byte CMDB6       :1;                                       /* NVM User Mode Command Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpCMDB :1;
    byte         :1;
    byte grpCMDB_2 :1;
    byte         :1;
    byte         :1;
    byte grpCMDB_5 :2;
    byte         :1;
  } MergedBits;
} FCMDSTR;
extern volatile FCMDSTR _FCMD @(REG_BASE + 0x00000106);
#define FCMD                            _FCMD.Byte
#define FCMD_CMDB0                      _FCMD.Bits.CMDB0
#define FCMD_CMDB2                      _FCMD.Bits.CMDB2
#define FCMD_CMDB5                      _FCMD.Bits.CMDB5
#define FCMD_CMDB6                      _FCMD.Bits.CMDB6
#define FCMD_CMDB_5                     _FCMD.MergedBits.grpCMDB_5
#define FCMD_CMDB                       FCMD_CMDB_5

#define FCMD_CMDB0_MASK                 1
#define FCMD_CMDB2_MASK                 4
#define FCMD_CMDB5_MASK                 32
#define FCMD_CMDB6_MASK                 64
#define FCMD_CMDB_5_MASK                96
#define FCMD_CMDB_5_BITNUM              5


/*** FADDR - Flash Address Register; 0x00000108 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FADDRHI - Flash Address Register High; 0x00000108 ***/
    union {
      byte Byte;
      struct {
        byte FABHI0      :1;                                       /* Flash Address High Bits, bit 0 */
        byte FABHI1      :1;                                       /* Flash Address High Bits, bit 1 */
        byte FABHI2      :1;                                       /* Flash Address High Bits, bit 2 */
        byte FABHI3      :1;                                       /* Flash Address High Bits, bit 3 */
        byte FABHI4      :1;                                       /* Flash Address High Bits, bit 4 */
        byte FABHI5      :1;                                       /* Flash Address High Bits, bit 5 */
        byte FABHI6      :1;                                       /* Flash Address High Bits, bit 6 */
        byte             :1; 
      } Bits;
      struct {
        byte grpFABHI :7;
        byte     :1;
      } MergedBits;
    } FADDRHISTR;
    #define FADDRHI                     _FADDR.Overlap_STR.FADDRHISTR.Byte
    #define FADDRHI_FABHI0              _FADDR.Overlap_STR.FADDRHISTR.Bits.FABHI0
    #define FADDRHI_FABHI1              _FADDR.Overlap_STR.FADDRHISTR.Bits.FABHI1
    #define FADDRHI_FABHI2              _FADDR.Overlap_STR.FADDRHISTR.Bits.FABHI2
    #define FADDRHI_FABHI3              _FADDR.Overlap_STR.FADDRHISTR.Bits.FABHI3
    #define FADDRHI_FABHI4              _FADDR.Overlap_STR.FADDRHISTR.Bits.FABHI4
    #define FADDRHI_FABHI5              _FADDR.Overlap_STR.FADDRHISTR.Bits.FABHI5
    #define FADDRHI_FABHI6              _FADDR.Overlap_STR.FADDRHISTR.Bits.FABHI6
    #define FADDRHI_FABHI               _FADDR.Overlap_STR.FADDRHISTR.MergedBits.grpFABHI
    
    #define FADDRHI_FABHI0_MASK         1
    #define FADDRHI_FABHI1_MASK         2
    #define FADDRHI_FABHI2_MASK         4
    #define FADDRHI_FABHI3_MASK         8
    #define FADDRHI_FABHI4_MASK         16
    #define FADDRHI_FABHI5_MASK         32
    #define FADDRHI_FABHI6_MASK         64
    #define FADDRHI_FABHI_MASK          127
    #define FADDRHI_FABHI_BITNUM        0
    

    /*** FADDRLO - Flash Address Register Low; 0x00000109 ***/
    union {
      byte Byte;
      struct {
        byte FABLO0      :1;                                       /* Flash Address Low Bits, bit 0 */
        byte FABLO1      :1;                                       /* Flash Address Low Bits, bit 1 */
        byte FABLO2      :1;                                       /* Flash Address Low Bits, bit 2 */
        byte FABLO3      :1;                                       /* Flash Address Low Bits, bit 3 */
        byte FABLO4      :1;                                       /* Flash Address Low Bits, bit 4 */
        byte FABLO5      :1;                                       /* Flash Address Low Bits, bit 5 */
        byte FABLO6      :1;                                       /* Flash Address Low Bits, bit 6 */
        byte FABLO7      :1;                                       /* Flash Address Low Bits, bit 7 */
      } Bits;
    } FADDRLOSTR;
    #define FADDRLO                     _FADDR.Overlap_STR.FADDRLOSTR.Byte
    #define FADDRLO_FABLO0              _FADDR.Overlap_STR.FADDRLOSTR.Bits.FABLO0
    #define FADDRLO_FABLO1              _FADDR.Overlap_STR.FADDRLOSTR.Bits.FABLO1
    #define FADDRLO_FABLO2              _FADDR.Overlap_STR.FADDRLOSTR.Bits.FABLO2
    #define FADDRLO_FABLO3              _FADDR.Overlap_STR.FADDRLOSTR.Bits.FABLO3
    #define FADDRLO_FABLO4              _FADDR.Overlap_STR.FADDRLOSTR.Bits.FABLO4
    #define FADDRLO_FABLO5              _FADDR.Overlap_STR.FADDRLOSTR.Bits.FABLO5
    #define FADDRLO_FABLO6              _FADDR.Overlap_STR.FADDRLOSTR.Bits.FABLO6
    #define FADDRLO_FABLO7              _FADDR.Overlap_STR.FADDRLOSTR.Bits.FABLO7
    
    #define FADDRLO_FABLO0_MASK         1
    #define FADDRLO_FABLO1_MASK         2
    #define FADDRLO_FABLO2_MASK         4
    #define FADDRLO_FABLO3_MASK         8
    #define FADDRLO_FABLO4_MASK         16
    #define FADDRLO_FABLO5_MASK         32
    #define FADDRLO_FABLO6_MASK         64
    #define FADDRLO_FABLO7_MASK         128
    
  } Overlap_STR;

