EmbeddedMan/history/hcs12/mc9s12dt256.h
  struct {
    word FABLO0      :1;                                       /* Flash Address Low Bits, bit 0 */
    word FABLO1      :1;                                       /* Flash Address Low Bits, bit 1 */
    word FABLO2      :1;                                       /* Flash Address Low Bits, bit 2 */
    word FABLO3      :1;                                       /* Flash Address Low Bits, bit 3 */
    word FABLO4      :1;                                       /* Flash Address Low Bits, bit 4 */
    word FABLO5      :1;                                       /* Flash Address Low Bits, bit 5 */
    word FABLO6      :1;                                       /* Flash Address Low Bits, bit 6 */
    word FABLO7      :1;                                       /* Flash Address Low Bits, bit 7 */
    word FABHI0      :1;                                       /* Flash Address High Bits, bit 0 */
    word FABHI1      :1;                                       /* Flash Address High Bits, bit 1 */
    word FABHI2      :1;                                       /* Flash Address High Bits, bit 2 */
    word FABHI3      :1;                                       /* Flash Address High Bits, bit 3 */
    word FABHI4      :1;                                       /* Flash Address High Bits, bit 4 */
    word FABHI5      :1;                                       /* Flash Address High Bits, bit 5 */
    word FABHI6      :1;                                       /* Flash Address High Bits, bit 6 */
    word             :1; 
  } Bits;
  struct {
    word grpFABLO :8;
    word grpFABHI :7;
    word         :1;
  } MergedBits;
} FADDRSTR;
extern volatile FADDRSTR _FADDR @(REG_BASE + 0x00000108);
#define FADDR                           _FADDR.Word
#define FADDR_FABLO0                    _FADDR.Bits.FABLO0
#define FADDR_FABLO1                    _FADDR.Bits.FABLO1
#define FADDR_FABLO2                    _FADDR.Bits.FABLO2
#define FADDR_FABLO3                    _FADDR.Bits.FABLO3
#define FADDR_FABLO4                    _FADDR.Bits.FABLO4
#define FADDR_FABLO5                    _FADDR.Bits.FABLO5
#define FADDR_FABLO6                    _FADDR.Bits.FABLO6
#define FADDR_FABLO7                    _FADDR.Bits.FABLO7
#define FADDR_FABHI0                    _FADDR.Bits.FABHI0
#define FADDR_FABHI1                    _FADDR.Bits.FABHI1
#define FADDR_FABHI2                    _FADDR.Bits.FABHI2
#define FADDR_FABHI3                    _FADDR.Bits.FABHI3
#define FADDR_FABHI4                    _FADDR.Bits.FABHI4
#define FADDR_FABHI5                    _FADDR.Bits.FABHI5
#define FADDR_FABHI6                    _FADDR.Bits.FABHI6
#define FADDR_FABLO                     _FADDR.MergedBits.grpFABLO
#define FADDR_FABHI                     _FADDR.MergedBits.grpFABHI

#define FADDR_FABLO0_MASK               1
#define FADDR_FABLO1_MASK               2
#define FADDR_FABLO2_MASK               4
#define FADDR_FABLO3_MASK               8
#define FADDR_FABLO4_MASK               16
#define FADDR_FABLO5_MASK               32
#define FADDR_FABLO6_MASK               64
#define FADDR_FABLO7_MASK               128
#define FADDR_FABHI0_MASK               256
#define FADDR_FABHI1_MASK               512
#define FADDR_FABHI2_MASK               1024
#define FADDR_FABHI3_MASK               2048
#define FADDR_FABHI4_MASK               4096
#define FADDR_FABHI5_MASK               8192
#define FADDR_FABHI6_MASK               16384
#define FADDR_FABLO_MASK                255
#define FADDR_FABLO_BITNUM              0
#define FADDR_FABHI_MASK                32512
#define FADDR_FABHI_BITNUM              8


/*** FDATA - Flash Data Register; 0x0000010A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FDATAHI - Flash Data Register High; 0x0000010A ***/
    union {
      byte Byte;
      struct {
        byte FDHI0       :1;                                       /* Flash Address High Bits, bit 0 */
        byte FDHI1       :1;                                       /* Flash Address High Bits, bit 1 */
        byte FDHI2       :1;                                       /* Flash Address High Bits, bit 2 */
        byte FDHI3       :1;                                       /* Flash Address High Bits, bit 3 */
        byte FDHI4       :1;                                       /* Flash Address High Bits, bit 4 */
        byte FDHI5       :1;                                       /* Flash Address High Bits, bit 5 */
        byte FDHI6       :1;                                       /* Flash Address High Bits, bit 6 */
        byte FDHI7       :1;                                       /* Flash Address High Bits, bit 7 */
      } Bits;
    } FDATAHISTR;
    #define FDATAHI                     _FDATA.Overlap_STR.FDATAHISTR.Byte
    #define FDATAHI_FDHI0               _FDATA.Overlap_STR.FDATAHISTR.Bits.FDHI0
    #define FDATAHI_FDHI1               _FDATA.Overlap_STR.FDATAHISTR.Bits.FDHI1
    #define FDATAHI_FDHI2               _FDATA.Overlap_STR.FDATAHISTR.Bits.FDHI2
    #define FDATAHI_FDHI3               _FDATA.Overlap_STR.FDATAHISTR.Bits.FDHI3
    #define FDATAHI_FDHI4               _FDATA.Overlap_STR.FDATAHISTR.Bits.FDHI4
    #define FDATAHI_FDHI5               _FDATA.Overlap_STR.FDATAHISTR.Bits.FDHI5
    #define FDATAHI_FDHI6               _FDATA.Overlap_STR.FDATAHISTR.Bits.FDHI6
    #define FDATAHI_FDHI7               _FDATA.Overlap_STR.FDATAHISTR.Bits.FDHI7
    
    #define FDATAHI_FDHI0_MASK          1
    #define FDATAHI_FDHI1_MASK          2
    #define FDATAHI_FDHI2_MASK          4
    #define FDATAHI_FDHI3_MASK          8
    #define FDATAHI_FDHI4_MASK          16
    #define FDATAHI_FDHI5_MASK          32
    #define FDATAHI_FDHI6_MASK          64
    #define FDATAHI_FDHI7_MASK          128
    

    /*** FDATALO - Flash Data Register Low; 0x0000010B ***/
    union {
      byte Byte;
      struct {
        byte FDLO0       :1;                                       /* Flash Data Low Bits, bit 0 */
        byte FDLO1       :1;                                       /* Flash Data Low Bits, bit 1 */
        byte FDLO2       :1;                                       /* Flash Data Low Bits, bit 2 */
        byte FDLO3       :1;                                       /* Flash Data Low Bits, bit 3 */
        byte FDLO4       :1;                                       /* Flash Data Low Bits, bit 4 */
        byte FDLO5       :1;                                       /* Flash Data Low Bits, bit 5 */
        byte FDLO6       :1;                                       /* Flash Data Low Bits, bit 6 */
        byte FDLO7       :1;                                       /* Flash Data Low Bits, bit 7 */
      } Bits;
    } FDATALOSTR;
    #define FDATALO                     _FDATA.Overlap_STR.FDATALOSTR.Byte
    #define FDATALO_FDLO0               _FDATA.Overlap_STR.FDATALOSTR.Bits.FDLO0
    #define FDATALO_FDLO1               _FDATA.Overlap_STR.FDATALOSTR.Bits.FDLO1
    #define FDATALO_FDLO2               _FDATA.Overlap_STR.FDATALOSTR.Bits.FDLO2
    #define FDATALO_FDLO3               _FDATA.Overlap_STR.FDATALOSTR.Bits.FDLO3
    #define FDATALO_FDLO4               _FDATA.Overlap_STR.FDATALOSTR.Bits.FDLO4
    #define FDATALO_FDLO5               _FDATA.Overlap_STR.FDATALOSTR.Bits.FDLO5
    #define FDATALO_FDLO6               _FDATA.Overlap_STR.FDATALOSTR.Bits.FDLO6
    #define FDATALO_FDLO7               _FDATA.Overlap_STR.FDATALOSTR.Bits.FDLO7
    
    #define FDATALO_FDLO0_MASK          1
    #define FDATALO_FDLO1_MASK          2
    #define FDATALO_FDLO2_MASK          4
    #define FDATALO_FDLO3_MASK          8
    #define FDATALO_FDLO4_MASK          16
    #define FDATALO_FDLO5_MASK          32
    #define FDATALO_FDLO6_MASK          64
    #define FDATALO_FDLO7_MASK          128
    
  } Overlap_STR;

