EmbeddedMan/history/hcs12/mc9s12dt256.h
  struct {
    word FDLO0       :1;                                       /* Flash Data Low Bits, bit 0 */
    word FDLO1       :1;                                       /* Flash Data Low Bits, bit 1 */
    word FDLO2       :1;                                       /* Flash Data Low Bits, bit 2 */
    word FDLO3       :1;                                       /* Flash Data Low Bits, bit 3 */
    word FDLO4       :1;                                       /* Flash Data Low Bits, bit 4 */
    word FDLO5       :1;                                       /* Flash Data Low Bits, bit 5 */
    word FDLO6       :1;                                       /* Flash Data Low Bits, bit 6 */
    word FDLO7       :1;                                       /* Flash Data Low Bits, bit 7 */
    word FDHI0       :1;                                       /* Flash Data High Bits, bit 0 */
    word FDHI1       :1;                                       /* Flash Data High Bits, bit 1 */
    word FDHI2       :1;                                       /* Flash Data High Bits, bit 2 */
    word FDHI3       :1;                                       /* Flash Data High Bits, bit 3 */
    word FDHI4       :1;                                       /* Flash Data High Bits, bit 4 */
    word FDHI5       :1;                                       /* Flash Data High Bits, bit 5 */
    word FDHI6       :1;                                       /* Flash Data High Bits, bit 6 */
    word FDHI7       :1;                                       /* Flash Data High Bits, bit 7 */
  } Bits;
  struct {
    word grpFDLO :8;
    word grpFDHI :8;
  } MergedBits;
} FDATASTR;
extern volatile FDATASTR _FDATA @(REG_BASE + 0x0000010A);
#define FDATA                           _FDATA.Word
#define FDATA_FDLO0                     _FDATA.Bits.FDLO0
#define FDATA_FDLO1                     _FDATA.Bits.FDLO1
#define FDATA_FDLO2                     _FDATA.Bits.FDLO2
#define FDATA_FDLO3                     _FDATA.Bits.FDLO3
#define FDATA_FDLO4                     _FDATA.Bits.FDLO4
#define FDATA_FDLO5                     _FDATA.Bits.FDLO5
#define FDATA_FDLO6                     _FDATA.Bits.FDLO6
#define FDATA_FDLO7                     _FDATA.Bits.FDLO7
#define FDATA_FDHI0                     _FDATA.Bits.FDHI0
#define FDATA_FDHI1                     _FDATA.Bits.FDHI1
#define FDATA_FDHI2                     _FDATA.Bits.FDHI2
#define FDATA_FDHI3                     _FDATA.Bits.FDHI3
#define FDATA_FDHI4                     _FDATA.Bits.FDHI4
#define FDATA_FDHI5                     _FDATA.Bits.FDHI5
#define FDATA_FDHI6                     _FDATA.Bits.FDHI6
#define FDATA_FDHI7                     _FDATA.Bits.FDHI7
#define FDATA_FDLO                      _FDATA.MergedBits.grpFDLO
#define FDATA_FDHI                      _FDATA.MergedBits.grpFDHI

#define FDATA_FDLO0_MASK                1
#define FDATA_FDLO1_MASK                2
#define FDATA_FDLO2_MASK                4
#define FDATA_FDLO3_MASK                8
#define FDATA_FDLO4_MASK                16
#define FDATA_FDLO5_MASK                32
#define FDATA_FDLO6_MASK                64
#define FDATA_FDLO7_MASK                128
#define FDATA_FDHI0_MASK                256
#define FDATA_FDHI1_MASK                512
#define FDATA_FDHI2_MASK                1024
#define FDATA_FDHI3_MASK                2048
#define FDATA_FDHI4_MASK                4096
#define FDATA_FDHI5_MASK                8192
#define FDATA_FDHI6_MASK                16384
#define FDATA_FDHI7_MASK                32768
#define FDATA_FDLO_MASK                 255
#define FDATA_FDLO_BITNUM               0
#define FDATA_FDHI_MASK                 65280
#define FDATA_FDHI_BITNUM               8


/*** ECLKDIV - EEPROM Clock Divider Register; 0x00000110 ***/
typedef union {
  byte Byte;
  struct {
    byte EDIV0       :1;                                       /* EEPROM Clock Divider 0 */
    byte EDIV1       :1;                                       /* EEPROM Clock Divider 1 */
    byte EDIV2       :1;                                       /* EEPROM Clock Divider 2 */
    byte EDIV3       :1;                                       /* EEPROM Clock Divider 3 */
    byte EDIV4       :1;                                       /* EEPROM Clock Divider 4 */
    byte EDIV5       :1;                                       /* EEPROM Clock Divider 5 */
    byte PRDIV8      :1;                                       /* Enable Prescaler by 8 */
    byte EDIVLD      :1;                                       /* EEPROM Clock Divider Loaded */
  } Bits;
  struct {
    byte grpEDIV :6;
    byte grpPRDIV_8 :1;
    byte         :1;
  } MergedBits;
} ECLKDIVSTR;
extern volatile ECLKDIVSTR _ECLKDIV @(REG_BASE + 0x00000110);
#define ECLKDIV                         _ECLKDIV.Byte
#define ECLKDIV_EDIV0                   _ECLKDIV.Bits.EDIV0
#define ECLKDIV_EDIV1                   _ECLKDIV.Bits.EDIV1
#define ECLKDIV_EDIV2                   _ECLKDIV.Bits.EDIV2
#define ECLKDIV_EDIV3                   _ECLKDIV.Bits.EDIV3
#define ECLKDIV_EDIV4                   _ECLKDIV.Bits.EDIV4
#define ECLKDIV_EDIV5                   _ECLKDIV.Bits.EDIV5
#define ECLKDIV_PRDIV8                  _ECLKDIV.Bits.PRDIV8
#define ECLKDIV_EDIVLD                  _ECLKDIV.Bits.EDIVLD
#define ECLKDIV_EDIV                    _ECLKDIV.MergedBits.grpEDIV

#define ECLKDIV_EDIV0_MASK              1
#define ECLKDIV_EDIV1_MASK              2
#define ECLKDIV_EDIV2_MASK              4
#define ECLKDIV_EDIV3_MASK              8
#define ECLKDIV_EDIV4_MASK              16
#define ECLKDIV_EDIV5_MASK              32
#define ECLKDIV_PRDIV8_MASK             64
#define ECLKDIV_EDIVLD_MASK             128
#define ECLKDIV_EDIV_MASK               63
#define ECLKDIV_EDIV_BITNUM             0


/*** ECNFG - EEPROM Configuration Register; 0x00000113 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte CCIE        :1;                                       /* Command Complete Interrupt Enable */
    byte CBEIE       :1;                                       /* Command Buffers Empty Interrupt Enable */
  } Bits;
} ECNFGSTR;
