EmbeddedMan/history/hcs12/mc9s12dt256.h
extern volatile ECNFGSTR _ECNFG @(REG_BASE + 0x00000113);
#define ECNFG                           _ECNFG.Byte
#define ECNFG_CCIE                      _ECNFG.Bits.CCIE
#define ECNFG_CBEIE                     _ECNFG.Bits.CBEIE

#define ECNFG_CCIE_MASK                 64
#define ECNFG_CBEIE_MASK                128


/*** EPROT - EEPROM Protection Register; 0x00000114 ***/
typedef union {
  byte Byte;
  struct {
    byte EP0         :1;                                       /* EEPROM Protection address size 0 */
    byte EP1         :1;                                       /* EEPROM Protection address size 1 */
    byte EP2         :1;                                       /* EEPROM Protection address size 2 */
    byte EPDIS       :1;                                       /* EEPROM Protection disable */
    byte NV4         :1;                                       /* Non Volatile Flag Bit 4 */
    byte NV5         :1;                                       /* Non Volatile Flag Bit 5 */
    byte NV6         :1;                                       /* Non Volatile Flag Bit 6 */
    byte EPOPEN      :1;                                       /* Opens the EEPROM block or a subsection of it for program or erase */
  } Bits;
  struct {
    byte grpEP   :3;
    byte         :1;
    byte grpNV_4 :3;
    byte         :1;
  } MergedBits;
} EPROTSTR;
extern volatile EPROTSTR _EPROT @(REG_BASE + 0x00000114);
#define EPROT                           _EPROT.Byte
#define EPROT_EP0                       _EPROT.Bits.EP0
#define EPROT_EP1                       _EPROT.Bits.EP1
#define EPROT_EP2                       _EPROT.Bits.EP2
#define EPROT_EPDIS                     _EPROT.Bits.EPDIS
#define EPROT_NV4                       _EPROT.Bits.NV4
#define EPROT_NV5                       _EPROT.Bits.NV5
#define EPROT_NV6                       _EPROT.Bits.NV6
#define EPROT_EPOPEN                    _EPROT.Bits.EPOPEN
#define EPROT_EP                        _EPROT.MergedBits.grpEP
#define EPROT_NV_4                      _EPROT.MergedBits.grpNV_4
#define EPROT_NV                        EPROT_NV_4

#define EPROT_EP0_MASK                  1
#define EPROT_EP1_MASK                  2
#define EPROT_EP2_MASK                  4
#define EPROT_EPDIS_MASK                8
#define EPROT_NV4_MASK                  16
#define EPROT_NV5_MASK                  32
#define EPROT_NV6_MASK                  64
#define EPROT_EPOPEN_MASK               128
#define EPROT_EP_MASK                   7
#define EPROT_EP_BITNUM                 0
#define EPROT_NV_4_MASK                 112
#define EPROT_NV_4_BITNUM               4


/*** ESTAT - EEPROM Status Register; 0x00000115 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte BLANK       :1;                                       /* Blank Verify Flag */
    byte             :1; 
    byte ACCERR      :1;                                       /* Access error */
    byte PVIOL       :1;                                       /* Protection violation */
    byte CCIF        :1;                                       /* Command Complete Interrupt Flag */
    byte CBEIF       :1;                                       /* Command Buffer Empty Interrupt Flag */
  } Bits;
} ESTATSTR;
extern volatile ESTATSTR _ESTAT @(REG_BASE + 0x00000115);
#define ESTAT                           _ESTAT.Byte
#define ESTAT_BLANK                     _ESTAT.Bits.BLANK
#define ESTAT_ACCERR                    _ESTAT.Bits.ACCERR
#define ESTAT_PVIOL                     _ESTAT.Bits.PVIOL
#define ESTAT_CCIF                      _ESTAT.Bits.CCIF
#define ESTAT_CBEIF                     _ESTAT.Bits.CBEIF

#define ESTAT_BLANK_MASK                4
#define ESTAT_ACCERR_MASK               16
#define ESTAT_PVIOL_MASK                32
#define ESTAT_CCIF_MASK                 64
#define ESTAT_CBEIF_MASK                128


/*** ECMD - EEPROM Command Buffer and Register; 0x00000116 ***/
typedef union {
  byte Byte;
  struct {
    byte CMDB0       :1;                                       /* EEPROM User Mode Command 0 */
    byte             :1; 
    byte CMDB2       :1;                                       /* EEPROM User Mode Command 2 */
    byte             :1; 
    byte             :1; 
    byte CMDB5       :1;                                       /* EEPROM User Mode Command 5 */
    byte CMDB6       :1;                                       /* EEPROM User Mode Command 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpCMDB :1;
    byte         :1;
    byte grpCMDB_2 :1;
    byte         :1;
    byte         :1;
    byte grpCMDB_5 :2;
    byte         :1;
  } MergedBits;
} ECMDSTR;
extern volatile ECMDSTR _ECMD @(REG_BASE + 0x00000116);
#define ECMD                            _ECMD.Byte
#define ECMD_CMDB0                      _ECMD.Bits.CMDB0
#define ECMD_CMDB2                      _ECMD.Bits.CMDB2
#define ECMD_CMDB5                      _ECMD.Bits.CMDB5
#define ECMD_CMDB6                      _ECMD.Bits.CMDB6
#define ECMD_CMDB_5                     _ECMD.MergedBits.grpCMDB_5
#define ECMD_CMDB                       ECMD_CMDB_5

#define ECMD_CMDB0_MASK                 1
#define ECMD_CMDB2_MASK                 4
#define ECMD_CMDB5_MASK                 32
#define ECMD_CMDB6_MASK                 64
#define ECMD_CMDB_5_MASK                96
#define ECMD_CMDB_5_BITNUM              5


/*** EADDR - EEPROM Address Register; 0x00000118 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** EADDRHI - EEPROM Address Register High; 0x00000118 ***/
    union {
      byte Byte;
      struct {
        byte EABHI0      :1;                                       /* EEPROM Address High Bits, bit 0 */
        byte EABHI1      :1;                                       /* EEPROM Address High Bits, bit 1 */
        byte EABHI2      :1;                                       /* EEPROM Address High Bits, bit 2 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpEABHI :3;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } EADDRHISTR;
    #define EADDRHI                     _EADDR.Overlap_STR.EADDRHISTR.Byte
    #define EADDRHI_EABHI0              _EADDR.Overlap_STR.EADDRHISTR.Bits.EABHI0
    #define EADDRHI_EABHI1              _EADDR.Overlap_STR.EADDRHISTR.Bits.EABHI1
    #define EADDRHI_EABHI2              _EADDR.Overlap_STR.EADDRHISTR.Bits.EABHI2
    #define EADDRHI_EABHI               _EADDR.Overlap_STR.EADDRHISTR.MergedBits.grpEABHI
    
    #define EADDRHI_EABHI0_MASK         1
    #define EADDRHI_EABHI1_MASK         2
    #define EADDRHI_EABHI2_MASK         4
    #define EADDRHI_EABHI_MASK          7
    #define EADDRHI_EABHI_BITNUM        0
    

    /*** EADDRLO - EEPROM Address Register Low; 0x00000119 ***/
    union {
      byte Byte;
      struct {
        byte EABLO0      :1;                                       /* EEPROM Address Low Bits, bit 0 */
        byte EABLO1      :1;                                       /* EEPROM Address Low Bits, bit 1 */
        byte EABLO2      :1;                                       /* EEPROM Address Low Bits, bit 2 */
        byte EABLO3      :1;                                       /* EEPROM Address Low Bits, bit 3 */
        byte EABLO4      :1;                                       /* EEPROM Address Low Bits, bit 4 */
        byte EABLO5      :1;                                       /* EEPROM Address Low Bits, bit 5 */
        byte EABLO6      :1;                                       /* EEPROM Address Low Bits, bit 6 */
        byte EABLO7      :1;                                       /* EEPROM Address Low Bits, bit 7 */
      } Bits;
    } EADDRLOSTR;
    #define EADDRLO                     _EADDR.Overlap_STR.EADDRLOSTR.Byte
    #define EADDRLO_EABLO0              _EADDR.Overlap_STR.EADDRLOSTR.Bits.EABLO0
    #define EADDRLO_EABLO1              _EADDR.Overlap_STR.EADDRLOSTR.Bits.EABLO1
    #define EADDRLO_EABLO2              _EADDR.Overlap_STR.EADDRLOSTR.Bits.EABLO2
    #define EADDRLO_EABLO3              _EADDR.Overlap_STR.EADDRLOSTR.Bits.EABLO3
    #define EADDRLO_EABLO4              _EADDR.Overlap_STR.EADDRLOSTR.Bits.EABLO4
    #define EADDRLO_EABLO5              _EADDR.Overlap_STR.EADDRLOSTR.Bits.EABLO5
    #define EADDRLO_EABLO6              _EADDR.Overlap_STR.EADDRLOSTR.Bits.EABLO6
    #define EADDRLO_EABLO7              _EADDR.Overlap_STR.EADDRLOSTR.Bits.EABLO7
    
    #define EADDRLO_EABLO0_MASK         1
    #define EADDRLO_EABLO1_MASK         2
    #define EADDRLO_EABLO2_MASK         4
    #define EADDRLO_EABLO3_MASK         8
    #define EADDRLO_EABLO4_MASK         16
    #define EADDRLO_EABLO5_MASK         32
    #define EADDRLO_EABLO6_MASK         64
    #define EADDRLO_EABLO7_MASK         128
    
  } Overlap_STR;

