EmbeddedMan/history/hcs12/mc9s12dt256.h
  struct {
    word EABLO0      :1;                                       /* EEPROM Address Low Bits, bit 0 */
    word EABLO1      :1;                                       /* EEPROM Address Low Bits, bit 1 */
    word EABLO2      :1;                                       /* EEPROM Address Low Bits, bit 2 */
    word EABLO3      :1;                                       /* EEPROM Address Low Bits, bit 3 */
    word EABLO4      :1;                                       /* EEPROM Address Low Bits, bit 4 */
    word EABLO5      :1;                                       /* EEPROM Address Low Bits, bit 5 */
    word EABLO6      :1;                                       /* EEPROM Address Low Bits, bit 6 */
    word EABLO7      :1;                                       /* EEPROM Address Low Bits, bit 7 */
    word EABHI0      :1;                                       /* EEPROM Address High Bits, bit 0 */
    word EABHI1      :1;                                       /* EEPROM Address High Bits, bit 1 */
    word EABHI2      :1;                                       /* EEPROM Address High Bits, bit 2 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpEABLO :8;
    word grpEABHI :3;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} EADDRSTR;
extern volatile EADDRSTR _EADDR @(REG_BASE + 0x00000118);
#define EADDR                           _EADDR.Word
#define EADDR_EABLO0                    _EADDR.Bits.EABLO0
#define EADDR_EABLO1                    _EADDR.Bits.EABLO1
#define EADDR_EABLO2                    _EADDR.Bits.EABLO2
#define EADDR_EABLO3                    _EADDR.Bits.EABLO3
#define EADDR_EABLO4                    _EADDR.Bits.EABLO4
#define EADDR_EABLO5                    _EADDR.Bits.EABLO5
#define EADDR_EABLO6                    _EADDR.Bits.EABLO6
#define EADDR_EABLO7                    _EADDR.Bits.EABLO7
#define EADDR_EABHI0                    _EADDR.Bits.EABHI0
#define EADDR_EABHI1                    _EADDR.Bits.EABHI1
#define EADDR_EABHI2                    _EADDR.Bits.EABHI2
#define EADDR_EABLO                     _EADDR.MergedBits.grpEABLO
#define EADDR_EABHI                     _EADDR.MergedBits.grpEABHI

#define EADDR_EABLO0_MASK               1
#define EADDR_EABLO1_MASK               2
#define EADDR_EABLO2_MASK               4
#define EADDR_EABLO3_MASK               8
#define EADDR_EABLO4_MASK               16
#define EADDR_EABLO5_MASK               32
#define EADDR_EABLO6_MASK               64
#define EADDR_EABLO7_MASK               128
#define EADDR_EABHI0_MASK               256
#define EADDR_EABHI1_MASK               512
#define EADDR_EABHI2_MASK               1024
#define EADDR_EABLO_MASK                255
#define EADDR_EABLO_BITNUM              0
#define EADDR_EABHI_MASK                1792
#define EADDR_EABHI_BITNUM              8


/*** EDATA - EEPROM Data Register; 0x0000011A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** EDATAHI - EEPROM Data Register High; 0x0000011A ***/
    union {
      byte Byte;
      struct {
        byte EDHI0       :1;                                       /* EEPROM Address High Bits, bit 0 */
        byte EDHI1       :1;                                       /* EEPROM Address High Bits, bit 1 */
        byte EDHI2       :1;                                       /* EEPROM Address High Bits, bit 2 */
        byte EDHI3       :1;                                       /* EEPROM Address High Bits, bit 3 */
        byte EDHI4       :1;                                       /* EEPROM Address High Bits, bit 4 */
        byte EDHI5       :1;                                       /* EEPROM Address High Bits, bit 5 */
        byte EDHI6       :1;                                       /* EEPROM Address High Bits, bit 6 */
        byte EDHI7       :1;                                       /* EEPROM Address High Bits, bit 7 */
      } Bits;
    } EDATAHISTR;
    #define EDATAHI                     _EDATA.Overlap_STR.EDATAHISTR.Byte
    #define EDATAHI_EDHI0               _EDATA.Overlap_STR.EDATAHISTR.Bits.EDHI0
    #define EDATAHI_EDHI1               _EDATA.Overlap_STR.EDATAHISTR.Bits.EDHI1
    #define EDATAHI_EDHI2               _EDATA.Overlap_STR.EDATAHISTR.Bits.EDHI2
    #define EDATAHI_EDHI3               _EDATA.Overlap_STR.EDATAHISTR.Bits.EDHI3
    #define EDATAHI_EDHI4               _EDATA.Overlap_STR.EDATAHISTR.Bits.EDHI4
    #define EDATAHI_EDHI5               _EDATA.Overlap_STR.EDATAHISTR.Bits.EDHI5
    #define EDATAHI_EDHI6               _EDATA.Overlap_STR.EDATAHISTR.Bits.EDHI6
    #define EDATAHI_EDHI7               _EDATA.Overlap_STR.EDATAHISTR.Bits.EDHI7
    
    #define EDATAHI_EDHI0_MASK          1
    #define EDATAHI_EDHI1_MASK          2
    #define EDATAHI_EDHI2_MASK          4
    #define EDATAHI_EDHI3_MASK          8
    #define EDATAHI_EDHI4_MASK          16
    #define EDATAHI_EDHI5_MASK          32
    #define EDATAHI_EDHI6_MASK          64
    #define EDATAHI_EDHI7_MASK          128
    

    /*** EDATALO - EEPROM Data Register Low; 0x0000011B ***/
    union {
      byte Byte;
      struct {
        byte EDLO0       :1;                                       /* EEPROM Data Low Bits, bit 0 */
        byte EDLO1       :1;                                       /* EEPROM Data Low Bits, bit 1 */
        byte EDLO2       :1;                                       /* EEPROM Data Low Bits, bit 2 */
        byte EDLO3       :1;                                       /* EEPROM Data Low Bits, bit 3 */
        byte EDLO4       :1;                                       /* EEPROM Data Low Bits, bit 4 */
        byte EDLO5       :1;                                       /* EEPROM Data Low Bits, bit 5 */
        byte EDLO6       :1;                                       /* EEPROM Data Low Bits, bit 6 */
        byte EDLO7       :1;                                       /* EEPROM Data Low Bits, bit 7 */
      } Bits;
    } EDATALOSTR;
    #define EDATALO                     _EDATA.Overlap_STR.EDATALOSTR.Byte
    #define EDATALO_EDLO0               _EDATA.Overlap_STR.EDATALOSTR.Bits.EDLO0
    #define EDATALO_EDLO1               _EDATA.Overlap_STR.EDATALOSTR.Bits.EDLO1
    #define EDATALO_EDLO2               _EDATA.Overlap_STR.EDATALOSTR.Bits.EDLO2
    #define EDATALO_EDLO3               _EDATA.Overlap_STR.EDATALOSTR.Bits.EDLO3
    #define EDATALO_EDLO4               _EDATA.Overlap_STR.EDATALOSTR.Bits.EDLO4
    #define EDATALO_EDLO5               _EDATA.Overlap_STR.EDATALOSTR.Bits.EDLO5
    #define EDATALO_EDLO6               _EDATA.Overlap_STR.EDATALOSTR.Bits.EDLO6
    #define EDATALO_EDLO7               _EDATA.Overlap_STR.EDATALOSTR.Bits.EDLO7
    
    #define EDATALO_EDLO0_MASK          1
    #define EDATALO_EDLO1_MASK          2
    #define EDATALO_EDLO2_MASK          4
    #define EDATALO_EDLO3_MASK          8
    #define EDATALO_EDLO4_MASK          16
    #define EDATALO_EDLO5_MASK          32
    #define EDATALO_EDLO6_MASK          64
    #define EDATALO_EDLO7_MASK          128
    
  } Overlap_STR;

