EmbeddedMan/history/hcs12/mc9s12dt256.h
  struct {
    word EDLO0       :1;                                       /* EEPROM Data Low Bits, bit 0 */
    word EDLO1       :1;                                       /* EEPROM Data Low Bits, bit 1 */
    word EDLO2       :1;                                       /* EEPROM Data Low Bits, bit 2 */
    word EDLO3       :1;                                       /* EEPROM Data Low Bits, bit 3 */
    word EDLO4       :1;                                       /* EEPROM Data Low Bits, bit 4 */
    word EDLO5       :1;                                       /* EEPROM Data Low Bits, bit 5 */
    word EDLO6       :1;                                       /* EEPROM Data Low Bits, bit 6 */
    word EDLO7       :1;                                       /* EEPROM Data Low Bits, bit 7 */
    word EDHI0       :1;                                       /* EEPROM Data High Bits, bit 0 */
    word EDHI1       :1;                                       /* EEPROM Data High Bits, bit 1 */
    word EDHI2       :1;                                       /* EEPROM Data High Bits, bit 2 */
    word EDHI3       :1;                                       /* EEPROM Data High Bits, bit 3 */
    word EDHI4       :1;                                       /* EEPROM Data High Bits, bit 4 */
    word EDHI5       :1;                                       /* EEPROM Data High Bits, bit 5 */
    word EDHI6       :1;                                       /* EEPROM Data High Bits, bit 6 */
    word EDHI7       :1;                                       /* EEPROM Data High Bits, bit 7 */
  } Bits;
  struct {
    word grpEDLO :8;
    word grpEDHI :8;
  } MergedBits;
} EDATASTR;
extern volatile EDATASTR _EDATA @(REG_BASE + 0x0000011A);
#define EDATA                           _EDATA.Word
#define EDATA_EDLO0                     _EDATA.Bits.EDLO0
#define EDATA_EDLO1                     _EDATA.Bits.EDLO1
#define EDATA_EDLO2                     _EDATA.Bits.EDLO2
#define EDATA_EDLO3                     _EDATA.Bits.EDLO3
#define EDATA_EDLO4                     _EDATA.Bits.EDLO4
#define EDATA_EDLO5                     _EDATA.Bits.EDLO5
#define EDATA_EDLO6                     _EDATA.Bits.EDLO6
#define EDATA_EDLO7                     _EDATA.Bits.EDLO7
#define EDATA_EDHI0                     _EDATA.Bits.EDHI0
#define EDATA_EDHI1                     _EDATA.Bits.EDHI1
#define EDATA_EDHI2                     _EDATA.Bits.EDHI2
#define EDATA_EDHI3                     _EDATA.Bits.EDHI3
#define EDATA_EDHI4                     _EDATA.Bits.EDHI4
#define EDATA_EDHI5                     _EDATA.Bits.EDHI5
#define EDATA_EDHI6                     _EDATA.Bits.EDHI6
#define EDATA_EDHI7                     _EDATA.Bits.EDHI7
#define EDATA_EDLO                      _EDATA.MergedBits.grpEDLO
#define EDATA_EDHI                      _EDATA.MergedBits.grpEDHI

#define EDATA_EDLO0_MASK                1
#define EDATA_EDLO1_MASK                2
#define EDATA_EDLO2_MASK                4
#define EDATA_EDLO3_MASK                8
#define EDATA_EDLO4_MASK                16
#define EDATA_EDLO5_MASK                32
#define EDATA_EDLO6_MASK                64
#define EDATA_EDLO7_MASK                128
#define EDATA_EDHI0_MASK                256
#define EDATA_EDHI1_MASK                512
#define EDATA_EDHI2_MASK                1024
#define EDATA_EDHI3_MASK                2048
#define EDATA_EDHI4_MASK                4096
#define EDATA_EDHI5_MASK                8192
#define EDATA_EDHI6_MASK                16384
#define EDATA_EDHI7_MASK                32768
#define EDATA_EDLO_MASK                 255
#define EDATA_EDLO_BITNUM               0
#define EDATA_EDHI_MASK                 65280
#define EDATA_EDHI_BITNUM               8


/*** ATD1CTL23 - ATD 1 Control Register 23; 0x00000122 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1CTL2 - ATD 1 Control Register 2; 0x00000122 ***/
    union {
      byte Byte;
      struct {
        byte ASCIF       :1;                                       /* ATD 1 Sequence Complete Interrupt Flag */
        byte ASCIE       :1;                                       /* ATD 1 Sequence Complete Interrupt Enable */
        byte ETRIGE      :1;                                       /* External Trigger Mode enable */
        byte ETRIGP      :1;                                       /* External Trigger Polarity */
        byte ETRIGLE     :1;                                       /* External Trigger Level/Edge control */
        byte AWAI        :1;                                       /* ATD Power Down in Wait Mode */
        byte AFFC        :1;                                       /* ATD Fast Conversion Complete Flag Clear */
        byte ADPU        :1;                                       /* ATD Disable / Power Down */
      } Bits;
    } ATD1CTL2STR;
    #define ATD1CTL2                    _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Byte
    #define ATD1CTL2_ASCIF              _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ASCIF
    #define ATD1CTL2_ASCIE              _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ASCIE
    #define ATD1CTL2_ETRIGE             _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ETRIGE
    #define ATD1CTL2_ETRIGP             _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ETRIGP
    #define ATD1CTL2_ETRIGLE            _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ETRIGLE
    #define ATD1CTL2_AWAI               _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.AWAI
    #define ATD1CTL2_AFFC               _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.AFFC
    #define ATD1CTL2_ADPU               _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ADPU
    
    #define ATD1CTL2_ASCIF_MASK         1
    #define ATD1CTL2_ASCIE_MASK         2
    #define ATD1CTL2_ETRIGE_MASK        4
    #define ATD1CTL2_ETRIGP_MASK        8
    #define ATD1CTL2_ETRIGLE_MASK       16
    #define ATD1CTL2_AWAI_MASK          32
    #define ATD1CTL2_AFFC_MASK          64
    #define ATD1CTL2_ADPU_MASK          128
    

    /*** ATD1CTL3 - ATD 1 Control Register 3; 0x00000123 ***/
    union {
      byte Byte;
      struct {
        byte FRZ0        :1;                                       /* Background Debug Freeze Enable Bit 0 */
        byte FRZ1        :1;                                       /* Background Debug Freeze Enable Bit 1 */
        byte FIFO        :1;                                       /* Result Register FIFO Mode */
        byte S1C         :1;                                       /* Conversion Sequence Length 1 */
        byte S2C         :1;                                       /* Conversion Sequence Length 2 */
        byte S4C         :1;                                       /* Conversion Sequence Length 4 */
        byte S8C         :1;                                       /* Conversion Sequence Length 8 */
        byte             :1; 
      } Bits;
      struct {
        byte grpFRZ :2;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } ATD1CTL3STR;
    #define ATD1CTL3                    _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Byte
    #define ATD1CTL3_FRZ0               _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.FRZ0
    #define ATD1CTL3_FRZ1               _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.FRZ1
    #define ATD1CTL3_FIFO               _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.FIFO
    #define ATD1CTL3_S1C                _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.S1C
    #define ATD1CTL3_S2C                _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.S2C
    #define ATD1CTL3_S4C                _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.S4C
    #define ATD1CTL3_S8C                _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.S8C
    #define ATD1CTL3_FRZ                _ATD1CTL23.Overlap_STR.ATD1CTL3STR.MergedBits.grpFRZ
    
