EmbeddedMan/history/hcs12/mc9s12dt256.h
/*** CAN4IDAC - MSCAN4 Identifier Acceptance Control Register; 0x0000028B ***/
typedef union {
  byte Byte;
  struct {
    byte IDHIT0      :1;                                       /* Identifier Acceptance Hit Indicator 0 */
    byte IDHIT1      :1;                                       /* Identifier Acceptance Hit Indicator 1 */
    byte IDHIT2      :1;                                       /* Identifier Acceptance Hit Indicator 2 */
    byte             :1; 
    byte IDAM0       :1;                                       /* Identifier Acceptance Mode 0 */
    byte IDAM1       :1;                                       /* Identifier Acceptance Mode 1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpIDHIT :3;
    byte         :1;
    byte grpIDAM :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4IDACSTR;
extern volatile CAN4IDACSTR _CAN4IDAC @(REG_BASE + 0x0000028B);
#define CAN4IDAC                        _CAN4IDAC.Byte
#define CAN4IDAC_IDHIT0                 _CAN4IDAC.Bits.IDHIT0
#define CAN4IDAC_IDHIT1                 _CAN4IDAC.Bits.IDHIT1
#define CAN4IDAC_IDHIT2                 _CAN4IDAC.Bits.IDHIT2
#define CAN4IDAC_IDAM0                  _CAN4IDAC.Bits.IDAM0
#define CAN4IDAC_IDAM1                  _CAN4IDAC.Bits.IDAM1
#define CAN4IDAC_IDHIT                  _CAN4IDAC.MergedBits.grpIDHIT
#define CAN4IDAC_IDAM                   _CAN4IDAC.MergedBits.grpIDAM

#define CAN4IDAC_IDHIT0_MASK            1
#define CAN4IDAC_IDHIT1_MASK            2
#define CAN4IDAC_IDHIT2_MASK            4
#define CAN4IDAC_IDAM0_MASK             16
#define CAN4IDAC_IDAM1_MASK             32
#define CAN4IDAC_IDHIT_MASK             7
#define CAN4IDAC_IDHIT_BITNUM           0
#define CAN4IDAC_IDAM_MASK              48
#define CAN4IDAC_IDAM_BITNUM            4


/*** CAN4RXERR - MSCAN4 Receive Error Counter Register; 0x0000028E ***/
typedef union {
  byte Byte;
  struct {
    byte RXERR0      :1;                                       /* Bit 0 */
    byte RXERR1      :1;                                       /* Bit 1 */
    byte RXERR2      :1;                                       /* Bit 2 */
    byte RXERR3      :1;                                       /* Bit 3 */
    byte RXERR4      :1;                                       /* Bit 4 */
    byte RXERR5      :1;                                       /* Bit 5 */
    byte RXERR6      :1;                                       /* Bit 6 */
    byte RXERR7      :1;                                       /* Bit 7 */
  } Bits;
} CAN4RXERRSTR;
extern volatile CAN4RXERRSTR _CAN4RXERR @(REG_BASE + 0x0000028E);
#define CAN4RXERR                       _CAN4RXERR.Byte
#define CAN4RXERR_RXERR0                _CAN4RXERR.Bits.RXERR0
#define CAN4RXERR_RXERR1                _CAN4RXERR.Bits.RXERR1
#define CAN4RXERR_RXERR2                _CAN4RXERR.Bits.RXERR2
#define CAN4RXERR_RXERR3                _CAN4RXERR.Bits.RXERR3
#define CAN4RXERR_RXERR4                _CAN4RXERR.Bits.RXERR4
#define CAN4RXERR_RXERR5                _CAN4RXERR.Bits.RXERR5
#define CAN4RXERR_RXERR6                _CAN4RXERR.Bits.RXERR6
#define CAN4RXERR_RXERR7                _CAN4RXERR.Bits.RXERR7

#define CAN4RXERR_RXERR0_MASK           1
#define CAN4RXERR_RXERR1_MASK           2
#define CAN4RXERR_RXERR2_MASK           4
#define CAN4RXERR_RXERR3_MASK           8
#define CAN4RXERR_RXERR4_MASK           16
#define CAN4RXERR_RXERR5_MASK           32
#define CAN4RXERR_RXERR6_MASK           64
#define CAN4RXERR_RXERR7_MASK           128


/*** CAN4TXERR - MSCAN4 Transmit Error Counter Register; 0x0000028F ***/
typedef union {
  byte Byte;
  struct {
    byte TXERR0      :1;                                       /* Bit 0 */
    byte TXERR1      :1;                                       /* Bit 1 */
    byte TXERR2      :1;                                       /* Bit 2 */
    byte TXERR3      :1;                                       /* Bit 3 */
    byte TXERR4      :1;                                       /* Bit 4 */
    byte TXERR5      :1;                                       /* Bit 5 */
    byte TXERR6      :1;                                       /* Bit 6 */
    byte TXERR7      :1;                                       /* Bit 7 */
  } Bits;
} CAN4TXERRSTR;
extern volatile CAN4TXERRSTR _CAN4TXERR @(REG_BASE + 0x0000028F);
#define CAN4TXERR                       _CAN4TXERR.Byte
#define CAN4TXERR_TXERR0                _CAN4TXERR.Bits.TXERR0
#define CAN4TXERR_TXERR1                _CAN4TXERR.Bits.TXERR1
#define CAN4TXERR_TXERR2                _CAN4TXERR.Bits.TXERR2
#define CAN4TXERR_TXERR3                _CAN4TXERR.Bits.TXERR3
#define CAN4TXERR_TXERR4                _CAN4TXERR.Bits.TXERR4
#define CAN4TXERR_TXERR5                _CAN4TXERR.Bits.TXERR5
#define CAN4TXERR_TXERR6                _CAN4TXERR.Bits.TXERR6
#define CAN4TXERR_TXERR7                _CAN4TXERR.Bits.TXERR7

#define CAN4TXERR_TXERR0_MASK           1
#define CAN4TXERR_TXERR1_MASK           2
#define CAN4TXERR_TXERR2_MASK           4
#define CAN4TXERR_TXERR3_MASK           8
#define CAN4TXERR_TXERR4_MASK           16
#define CAN4TXERR_TXERR5_MASK           32
#define CAN4TXERR_TXERR6_MASK           64
#define CAN4TXERR_TXERR7_MASK           128


/*** CAN4IDAR0 - MSCAN4 Identifier Acceptance Register 0; 0x00000290 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN4IDAR0STR;
