EmbeddedMan/history/hcs12/mc9s12dt256.h
#define BAKEY1_KEY0_MASK                1
#define BAKEY1_KEY1_MASK                2
#define BAKEY1_KEY2_MASK                4
#define BAKEY1_KEY3_MASK                8
#define BAKEY1_KEY4_MASK                16
#define BAKEY1_KEY5_MASK                32
#define BAKEY1_KEY6_MASK                64
#define BAKEY1_KEY7_MASK                128
#define BAKEY1_KEY8_MASK                256
#define BAKEY1_KEY9_MASK                512
#define BAKEY1_KEY10_MASK               1024
#define BAKEY1_KEY11_MASK               2048
#define BAKEY1_KEY12_MASK               4096
#define BAKEY1_KEY13_MASK               8192
#define BAKEY1_KEY14_MASK               16384
#define BAKEY1_KEY15_MASK               32768


/*** BAKEY2 - Backdoor Access Key 2; 0x0000FF04 ***/
typedef union {
  word Word;
  struct {
    word KEY0        :1;                                       /* Backdoor Access Key bits, bit 0 */
    word KEY1        :1;                                       /* Backdoor Access Key bits, bit 1 */
    word KEY2        :1;                                       /* Backdoor Access Key bits, bit 2 */
    word KEY3        :1;                                       /* Backdoor Access Key bits, bit 3 */
    word KEY4        :1;                                       /* Backdoor Access Key bits, bit 4 */
    word KEY5        :1;                                       /* Backdoor Access Key bits, bit 5 */
    word KEY6        :1;                                       /* Backdoor Access Key bits, bit 6 */
    word KEY7        :1;                                       /* Backdoor Access Key bits, bit 7 */
    word KEY8        :1;                                       /* Backdoor Access Key bits, bit 8 */
    word KEY9        :1;                                       /* Backdoor Access Key bits, bit 9 */
    word KEY10       :1;                                       /* Backdoor Access Key bits, bit 10 */
    word KEY11       :1;                                       /* Backdoor Access Key bits, bit 11 */
    word KEY12       :1;                                       /* Backdoor Access Key bits, bit 12 */
    word KEY13       :1;                                       /* Backdoor Access Key bits, bit 13 */
    word KEY14       :1;                                       /* Backdoor Access Key bits, bit 14 */
    word KEY15       :1;                                       /* Backdoor Access Key bits, bit 15 */
  } Bits;
} BAKEY2STR;
/* Tip for register initialization in the user code:  const word BAKEY2_INIT @0x0000FF04 = <BAKEY2_INITVAL>; */
#define _BAKEY2 (*(const BAKEY2STR *)0x0000FF04)
#define BAKEY2                          _BAKEY2.Word
#define BAKEY2_KEY0                     _BAKEY2.Bits.KEY0
#define BAKEY2_KEY1                     _BAKEY2.Bits.KEY1
#define BAKEY2_KEY2                     _BAKEY2.Bits.KEY2
#define BAKEY2_KEY3                     _BAKEY2.Bits.KEY3
#define BAKEY2_KEY4                     _BAKEY2.Bits.KEY4
#define BAKEY2_KEY5                     _BAKEY2.Bits.KEY5
#define BAKEY2_KEY6                     _BAKEY2.Bits.KEY6
#define BAKEY2_KEY7                     _BAKEY2.Bits.KEY7
#define BAKEY2_KEY8                     _BAKEY2.Bits.KEY8
#define BAKEY2_KEY9                     _BAKEY2.Bits.KEY9
#define BAKEY2_KEY10                    _BAKEY2.Bits.KEY10
#define BAKEY2_KEY11                    _BAKEY2.Bits.KEY11
#define BAKEY2_KEY12                    _BAKEY2.Bits.KEY12
#define BAKEY2_KEY13                    _BAKEY2.Bits.KEY13
#define BAKEY2_KEY14                    _BAKEY2.Bits.KEY14
#define BAKEY2_KEY15                    _BAKEY2.Bits.KEY15

#define BAKEY2_KEY0_MASK                1
#define BAKEY2_KEY1_MASK                2
#define BAKEY2_KEY2_MASK                4
#define BAKEY2_KEY3_MASK                8
#define BAKEY2_KEY4_MASK                16
#define BAKEY2_KEY5_MASK                32
#define BAKEY2_KEY6_MASK                64
#define BAKEY2_KEY7_MASK                128
#define BAKEY2_KEY8_MASK                256
#define BAKEY2_KEY9_MASK                512
#define BAKEY2_KEY10_MASK               1024
#define BAKEY2_KEY11_MASK               2048
#define BAKEY2_KEY12_MASK               4096
#define BAKEY2_KEY13_MASK               8192
#define BAKEY2_KEY14_MASK               16384
#define BAKEY2_KEY15_MASK               32768


/*** BAKEY3 - Backdoor Access Key 3; 0x0000FF06 ***/
typedef union {
  word Word;
  struct {
    word KEY0        :1;                                       /* Backdoor Access Key bits, bit 0 */
    word KEY1        :1;                                       /* Backdoor Access Key bits, bit 1 */
    word KEY2        :1;                                       /* Backdoor Access Key bits, bit 2 */
    word KEY3        :1;                                       /* Backdoor Access Key bits, bit 3 */
    word KEY4        :1;                                       /* Backdoor Access Key bits, bit 4 */
    word KEY5        :1;                                       /* Backdoor Access Key bits, bit 5 */
    word KEY6        :1;                                       /* Backdoor Access Key bits, bit 6 */
    word KEY7        :1;                                       /* Backdoor Access Key bits, bit 7 */
    word KEY8        :1;                                       /* Backdoor Access Key bits, bit 8 */
    word KEY9        :1;                                       /* Backdoor Access Key bits, bit 9 */
    word KEY10       :1;                                       /* Backdoor Access Key bits, bit 10 */
    word KEY11       :1;                                       /* Backdoor Access Key bits, bit 11 */
    word KEY12       :1;                                       /* Backdoor Access Key bits, bit 12 */
    word KEY13       :1;                                       /* Backdoor Access Key bits, bit 13 */
    word KEY14       :1;                                       /* Backdoor Access Key bits, bit 14 */
    word KEY15       :1;                                       /* Backdoor Access Key bits, bit 15 */
  } Bits;
} BAKEY3STR;
/* Tip for register initialization in the user code:  const word BAKEY3_INIT @0x0000FF06 = <BAKEY3_INITVAL>; */
#define _BAKEY3 (*(const BAKEY3STR *)0x0000FF06)
#define BAKEY3                          _BAKEY3.Word
#define BAKEY3_KEY0                     _BAKEY3.Bits.KEY0
#define BAKEY3_KEY1                     _BAKEY3.Bits.KEY1
#define BAKEY3_KEY2                     _BAKEY3.Bits.KEY2
#define BAKEY3_KEY3                     _BAKEY3.Bits.KEY3
#define BAKEY3_KEY4                     _BAKEY3.Bits.KEY4
#define BAKEY3_KEY5                     _BAKEY3.Bits.KEY5
#define BAKEY3_KEY6                     _BAKEY3.Bits.KEY6
#define BAKEY3_KEY7                     _BAKEY3.Bits.KEY7
#define BAKEY3_KEY8                     _BAKEY3.Bits.KEY8
#define BAKEY3_KEY9                     _BAKEY3.Bits.KEY9
#define BAKEY3_KEY10                    _BAKEY3.Bits.KEY10
#define BAKEY3_KEY11                    _BAKEY3.Bits.KEY11
#define BAKEY3_KEY12                    _BAKEY3.Bits.KEY12
#define BAKEY3_KEY13                    _BAKEY3.Bits.KEY13
#define BAKEY3_KEY14                    _BAKEY3.Bits.KEY14
#define BAKEY3_KEY15                    _BAKEY3.Bits.KEY15

#define BAKEY3_KEY0_MASK                1
#define BAKEY3_KEY1_MASK                2
#define BAKEY3_KEY2_MASK                4
#define BAKEY3_KEY3_MASK                8
#define BAKEY3_KEY4_MASK                16
#define BAKEY3_KEY5_MASK                32
#define BAKEY3_KEY6_MASK                64
#define BAKEY3_KEY7_MASK                128
#define BAKEY3_KEY8_MASK                256
#define BAKEY3_KEY9_MASK                512
#define BAKEY3_KEY10_MASK               1024
#define BAKEY3_KEY11_MASK               2048
#define BAKEY3_KEY12_MASK               4096
#define BAKEY3_KEY13_MASK               8192
#define BAKEY3_KEY14_MASK               16384
#define BAKEY3_KEY15_MASK               32768


/*** NVFPROT3 - Non volatile Block 3 Flash Protection Register; 0x0000FF0A ***/
typedef union {
  byte Byte;
  struct {
    byte FPLS0       :1;                                       /* Flash Protection Lower Address size 0 */
    byte FPLS1       :1;                                       /* Flash Protection Lower Address size 1 */
    byte FPLDIS      :1;                                       /* Flash Protection Lower address range disable */
    byte FPHS0       :1;                                       /* Flash Protection Higher address size 0 */
    byte FPHS1       :1;                                       /* Flash Protection Higher address size 1 */
    byte FPHDIS      :1;                                       /* Flash Protection Higher address range disable */
    byte NV6         :1;                                       /* Non Volatile Flag Bit */
    byte FPOPEN      :1;                                       /* Opens the flash block or subsections of it for program or erase */
  } Bits;
  struct {
    byte grpFPLS :2;
    byte         :1;
    byte grpFPHS :2;
    byte         :1;
    byte grpNV_6 :1;
    byte         :1;
  } MergedBits;
} NVFPROT3STR;
/* Tip for register initialization in the user code:  const byte NVFPROT3_INIT @0x0000FF0A = <NVFPROT3_INITVAL>; */
#define _NVFPROT3 (*(const NVFPROT3STR *)0x0000FF0A)
#define NVFPROT3                        _NVFPROT3.Byte
#define NVFPROT3_FPLS0                  _NVFPROT3.Bits.FPLS0
#define NVFPROT3_FPLS1                  _NVFPROT3.Bits.FPLS1
#define NVFPROT3_FPLDIS                 _NVFPROT3.Bits.FPLDIS
#define NVFPROT3_FPHS0                  _NVFPROT3.Bits.FPHS0
#define NVFPROT3_FPHS1                  _NVFPROT3.Bits.FPHS1
#define NVFPROT3_FPHDIS                 _NVFPROT3.Bits.FPHDIS
#define NVFPROT3_NV6                    _NVFPROT3.Bits.NV6
#define NVFPROT3_FPOPEN                 _NVFPROT3.Bits.FPOPEN
#define NVFPROT3_FPLS                   _NVFPROT3.MergedBits.grpFPLS
#define NVFPROT3_FPHS                   _NVFPROT3.MergedBits.grpFPHS

#define NVFPROT3_FPLS0_MASK             1
#define NVFPROT3_FPLS1_MASK             2
#define NVFPROT3_FPLDIS_MASK            4
#define NVFPROT3_FPHS0_MASK             8
#define NVFPROT3_FPHS1_MASK             16
#define NVFPROT3_FPHDIS_MASK            32
#define NVFPROT3_NV6_MASK               64
#define NVFPROT3_FPOPEN_MASK            128
#define NVFPROT3_FPLS_MASK              3
#define NVFPROT3_FPLS_BITNUM            0
#define NVFPROT3_FPHS_MASK              24
#define NVFPROT3_FPHS_BITNUM            3


/*** NVFPROT2 - Non volatile Block 2 Flash Protection Register; 0x0000FF0B ***/
typedef union {
  byte Byte;
  struct {
    byte FPLS0       :1;                                       /* Flash Protection Lower Address size 0 */
    byte FPLS1       :1;                                       /* Flash Protection Lower Address size 1 */
    byte FPLDIS      :1;                                       /* Flash Protection Lower address range disable */
    byte FPHS0       :1;                                       /* Flash Protection Higher address size 0 */
    byte FPHS1       :1;                                       /* Flash Protection Higher address size 1 */
    byte FPHDIS      :1;                                       /* Flash Protection Higher address range disable */
    byte NV6         :1;                                       /* Non Volatile Flag Bit */
    byte FPOPEN      :1;                                       /* Opens the flash block or subsections of it for program or erase */
  } Bits;
  struct {
    byte grpFPLS :2;
    byte         :1;
    byte grpFPHS :2;
    byte         :1;
    byte grpNV_6 :1;
    byte         :1;
  } MergedBits;
} NVFPROT2STR;
/* Tip for register initialization in the user code:  const byte NVFPROT2_INIT @0x0000FF0B = <NVFPROT2_INITVAL>; */
#define _NVFPROT2 (*(const NVFPROT2STR *)0x0000FF0B)
#define NVFPROT2                        _NVFPROT2.Byte
#define NVFPROT2_FPLS0                  _NVFPROT2.Bits.FPLS0
#define NVFPROT2_FPLS1                  _NVFPROT2.Bits.FPLS1
#define NVFPROT2_FPLDIS                 _NVFPROT2.Bits.FPLDIS
#define NVFPROT2_FPHS0                  _NVFPROT2.Bits.FPHS0
#define NVFPROT2_FPHS1                  _NVFPROT2.Bits.FPHS1
#define NVFPROT2_FPHDIS                 _NVFPROT2.Bits.FPHDIS
#define NVFPROT2_NV6                    _NVFPROT2.Bits.NV6
#define NVFPROT2_FPOPEN                 _NVFPROT2.Bits.FPOPEN
#define NVFPROT2_FPLS                   _NVFPROT2.MergedBits.grpFPLS
#define NVFPROT2_FPHS                   _NVFPROT2.MergedBits.grpFPHS

